Repository: dotnet/NuGet.BuildTasks
Catalog: src/Microsoft.NuGet.Build.Tasks/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PackageFolderNotFound
source: The package {0} with version {1} could not be found in {2}. Run a NuGet package restore to download the package.
cs: V {2} nebyl nalezen balíček {0} s verzí {1}. Spuštěním obnovení balíčku NuGet tento balíček stáhněte.
de: Das Paket "{0}" der Version {1} wurde in "{2}" nicht gefunden. Führen Sie eine NuGet-Paketwiederherstellung aus, um das Paket herunterzuladen.
es: No se encuentra el paquete {0} con la versión {1} en {2}. Ejecute una restauración de paquetes NuGet para descargar el paquete.
fr: Le package {0} avec la version {1} est introuvable dans {2}. Exécutez une restauration de package NuGet pour télécharger le package.
it: Non è stato possibile trovare il pacchetto {0} con versione {1} in {2}. Per scaricare il pacchetto, eseguire un ripristino del pacchetto NuGet.
ja: バージョン {1} のパッケージ {0} が {2} に見つかりませんでした。パッケージをダウンロードするには、NuGet パッケージの復元を実行してください。
ko: {2}에서 {1} 버전의 {0} 패키지를 찾을 수 없습니다. NuGet 패키지 복원을 실행하여 패키지를 다운로드하세요.
pl: Nie można znaleźć pakietu {0} w wersji {1} w ścieżce {2}. Uruchom przywracanie pakietu NuGet, aby pobrać pakiet.
pt_br: Não foi possível localizar o pacote {0} com a versão {1} em {2}. Execute uma restauração do pacote NuGet para baixar o pacote.
ru: Не удалось найти пакет {0} версии {1} в {2}. Выполните восстановление пакета NuGet, чтобы скачать пакет.
tr: {1} sürümüne sahip {0} paketi {2} konumunda bulunamadı. Paketi indirmek için NuGet paket geri yükleme işlemini çalıştırın.
zh_hans: 在 {2} 中找不到版本 {1} 的包 {0}。请运行 NuGet 包还原以下载该包。
zh_hant: 在 {2} 中找不到版本為 {1} 的套件 {0}。請執行 NuGet 套件還原以下載該套件。

# PreprocessedDirectoryNotSet
source: The {0} property must be set in order to consume preprocessed content.
cs: Aby bylo možné používat předem zpracovaný obsah, musí být nastavena vlastnost {0}.
de: Die {0}-Eigenschaft muss festgelegt werden, um vorverarbeiteten Inhalt zu nutzen.
es: Debe establecerse la propiedad {0} para poder consumir contenido preprocesado.
fr: La propriété {0} doit être définie pour pouvoir consommer le contenu prétraité.
it: Per utilizzare contenuto pre-elaborato, è necessario impostare la proprietà {0}.
ja: 前処理されたコンテンツを使用するには、{0} プロパティを設定する必要があります。
ko: 전처리된 콘텐츠를 사용하려면 {0} 속성을 설정해야 합니다.
pl: Właściwość {0} musi być ustawiona w celu użycia wstępnie przetworzonej zawartości.
pt_br: A propriedade {0} precisa ser definida para consumir conteúdo pré-processado.
ru: Чтобы использовать предварительно обработанное содержимое, необходимо задать свойство {0}.
tr: Önceden işlenmiş içeriği kullanmak için {0} özelliğinin ayarlanmış olması gerekir.
zh_hans: 必须设置 {0} 属性才能使用预处理过的内容。
zh_hant: 必須設定 {0} 屬性，才能使用經過前置處理的內容。

# UnspecifiedToken
source: The token '{0}' is unrecognized.
cs: Token {0} nebyl rozpoznán.
de: Das Token "{0}" wird nicht erkannt.
es: No se reconoce el token "{0}".
fr: Le jeton '{0}' n'est pas reconnu.
it: Il token '{0}' non è riconosciuto.
ja: トークン '{0}' は認識されていません。
ko: '{0}' 토큰을 인식할 수 없습니다.
pl: Token „{0}” nie został rozpoznany.
pt_br: O token '{0}' não é reconhecido.
ru: Токен "{0}" не распознан.
tr: '{0}' belirteci tanınmıyor.
zh_hans: 无法识别令牌“{0}”。
zh_hant: 無法辨識語彙基元 '{0}'。

# MissingRuntimeIdentifierInProjectFile
source: Your project file doesn't list '{0}' as a "RuntimeIdentifier". You should add '{1}' to the "RuntimeIdentifiers" property in your project file and then re-run NuGet restore. RuntimeIdentifiers should always be the complete list of RIDs supported by the project, regardless of the current configuration, platform or target. A single unconditioned RuntimeIdentifiers property is recommended.
es: El archivo del proyecto no muestra "{0}" como "RuntimeIdentifier". Debe agregar "{1}" a la propiedad "RuntimeIdentifiers" en el archivo del proyecto y volver a ejecutar la restauración de paquetes NuGet.
it: Il file di progetto non elenca '{0}' come "RuntimeIdentifier". È necessario aggiungere '{1}' alla proprietà "RuntimeIdentifiers" nel file di progetto e quindi eseguire di nuovo il ripristino di NuGet.
ko: 프로젝트 파일에 '{0}'이(가) "RuntimeIdentifier"로 나열되지 않습니다. 프로젝트 파일의 "RuntimeIdentifiers" 속성에 '{1}'을(를) 추가한 후 NuGet 복원을 다시 실행해야 합니다.
ru: Файл проекта не перечисляет "{0}" как "RuntimeIdentifier". Необходимо добавить "{1}" в свойство "RuntimeIdentifiers" в файле проекта, а затем повторно запустить восстановление NuGet.
tr: '{0}' tanımlayıcısı, proje dosyanızda "RuntimeIdentifier" olarak listelenmiyor. Proje dosyanızın "RuntimeIdentifiers" özelliğine '{1}' tanımlayıcısını eklemeniz ve sonra NuGet geri yükleme işlemini yeniden çalıştırmanız gerekiyor.
zh_hans: 项目文件未将“{0}”列为 "RuntimeIdentifier"。应在项目文件的 "RuntimeIdentifiers" 属性中添加“{1}”，然后重新运行 NuGet 还原。

# MissingRuntimeIdentifierInProjectFile
source: Your project file doesn't list '{0}' as a "RuntimeIdentifier". You should add '{1}' to the "RuntimeIdentifiers" property in your project file and then re-run NuGet restore.
zh_hant: 您的專案檔未將 '{0}' 列為 "RuntimeIdentifier"。您應該將 '{1}' 新增到專案檔中的 "RuntimeIdentifiers" 屬性，然後重新執行 NuGet 還原。
