Repository: dotnet/NuGet.BuildTasks
Catalog: src/Microsoft.NuGet.Build.Tasks/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DuplicatePreprocessorToken
source: The preprocessor token '{0}' has been given more than one value. Choosing '{1}' as the value.
cs: Token preprocesoru {0} získal více než jednu hodnotu. Volí se hodnota {1}.
de: Das Präprozessortoken "{0}" wurde mit mehreren Werten versehen. "{1}" wird als Wert ausgewählt.
es: Se han dado varios valores al token de preprocesador "{0}". Se va a elegir "{1}" como valor.
fr: Le jeton de préprocesseur '{0}' a reçu plusieurs valeurs. La valeur choisie est '{1}'.
it: Al token di preprocessore '{0}' è stato assegnato più di un valore. Come valore verrà scelto '{1}'.
ja: プリプロセッサ トークン '{0}' に複数の値が指定されています。値として '{1}' を選択します。
ko: 전처리기 토큰 '{0}'의 값이 두 개 이상 지정되었습니다. '{1}'을(를) 값으로 선택합니다.
pl: Dla tokenu preprocesora „{0}” podano więcej niż jedną wartość. Wybieranie elementu „{1}” jako wartości.
pt_br: O token de pré-processador '{0}' recebeu mais de um valor. Escolhendo '{1}' como o valor.
ru: Для маркера препроцессора "{0}" указано более одного значения. В качестве значения будет использовано "{1}".
tr: '{0}' ön işlemci belirtecine birden fazla değer verildi. Değer olarak '{1}' seçiliyor.
zh_hans: 已向预处理器标记“{0}”提供多个值。选择“{1}”作为值。
zh_hant: 已為前置處理器語彙基元 '{0}' 指定多個值。正在選擇 '{1}' 作為值。

# LockFileNotFoundForProjectFile
source: Assets file {0} couldn't be found. Run a NuGet package restore to generate this file.
cs: Nebyl nalezen soubor prostředků {0}. Pokud chcete tento soubor vygenerovat, spusťte obnovení balíčku NuGet.
de: Die Ressourcendatei "{0}" wurde nicht gefunden. Führen Sie eine NuGet-Paketwiederherstellung aus, um diese Datei zu generieren.
es: No se encuentra el archivo de recursos {0}. Ejecute una restauración de paquetes NuGet para generar el archivo.
fr: Fichier de composants {0} introuvable. Exécutez une restauration de package NuGet pour générer ce fichier.
it: Non è stato possibile trovare il file di asset {0}. Per generare questo file, eseguire un ripristino del pacchetto NuGet.
ja: アセット ファイル {0} が見つかりませんでした。NuGet パッケージの復元を実行して、このファイルを生成してください。
ko: 자산 파일 {0}을(를) 찾을 수 없습니다. NuGet 패키지 복원을 실행하여 이 파일을 생성하세요.
pl: Nie można odnaleźć pliku zasobów „{0}”. Uruchom przywracanie pakietu NuGet, aby wygenerować ten plik.
pt_br: Não foi possível localizar o arquivo de ativos {0}. Execute uma restauração do pacote NuGet para gerar esse arquivo.
ru: Файл ресурсов {0} не найден. Выполните восстановление пакета NuGet, чтобы создать этот файл.
tr: {0} varlık dosyası bulunamadı. Bu dosyayı oluşturmak için NuGet paketi geri yükleme işlemi gerçekleştirin.
zh_hans: 找不到资产文件“{0}”。请运行 NuGet 包还原以生成此文件。
zh_hant: 找不到資產檔案 {0}。請執行 NuGet 套件還原，以產生此檔案。

# LockFileNotFoundForProjectJson
source: Lock file {0} couldn't be found. Run a NuGet package restore to generate this file.
cs: Nebyl nalezen soubor zámku {0}. Pokud chcete tento soubor vygenerovat, spusťte obnovení balíčku NuGet.
de: Die Sperrdatei "{0}" wurde nicht gefunden. Führen Sie eine NuGet-Paketwiederherstellung aus, um diese Datei zu generieren.
es: No se encuentra el archivo de bloqueo {0}. Ejecute una restauración de paquetes NuGet para generar el archivo.
fr: Fichier de verrouillage {0} introuvable. Exécutez une restauration de package NuGet pour générer ce fichier.
it: Non è stato possibile trovare il file di blocco {0}. Per generare questo file, eseguire un ripristino del pacchetto NuGet.
ja: ロック ファイル {0} が見つかりませんでした。NuGet パッケージの復元を実行して、このファイルを生成してください。
ko: 잠금 파일 {0}을(를) 찾을 수 없습니다. NuGet 패키지 복원을 실행하여 이 파일을 생성하세요.
pl: Nie można odnaleźć pliku blokady {0}. Uruchom przywracanie pakietu NuGet, aby wygenerować ten plik.
pt_br: Não foi possível localizar o arquivo de bloqueio {0}. Execute uma restauração do pacote NuGet para gerar esse arquivo.
ru: Не удалось найти файл блокировки {0}. Выполните восстановление пакета NuGet, чтобы создать этот файл.
tr: {0} kilit dosyası bulunamadı. Bu dosyayı oluşturmak için NuGet paketi geri yükleme işlemi gerçekleştirin.
zh_hans: 找不到锁定文件 {0}。请运行 NuGet 包还原以生成此文件。
zh_hant: 找不到鎖定檔案 {0}。請執行 NuGet 套件還原，以產生此檔案。

# MissingFrameworkInProjectFile
source: Your project does not reference "{0}" framework. Add a reference to "{0}" in the "TargetFrameworks" property of your project file and then re-run NuGet restore.
cs: Váš projekt neobsahuje referenci na architekturu {0}. Přidejte referenci na {0} do vlastnosti TargetFrameworks v souboru projektu a pak znovu spusťte obnovení balíčku NuGet.
de: Ihr Projekt verweist nicht auf das Framework "{0}". Fügen Sie in der Eigenschaft "TargetFrameworks" der Projektdatei einen Verweis auf "{0}" hinzu, und führen Sie dann die NuGet-Wiederherstellung erneut aus.
es: El proyecto no hace referencia al marco "{0}". Agregue una referencia a "{0}" en la propiedad "TargetFrameworks" del archivo del proyecto y vuelva a ejecutar la restauración de paquetes NuGet.
fr: Votre projet ne référence pas le framework "{0}". Ajoutez une référence à "{0}" dans la propriété "TargetFrameworks" de votre fichier projet, puis réexécutez la restauration NuGet.
it: Il progetto non fa riferimento al framework "{0}". Aggiungere un riferimento a "{0}" nella proprietà "TargetFrameworks" del file di progetto e quindi eseguire di nuovo il ripristino di NuGet.
ja: プロジェクトが "{0}" フレームワークを参照していません。プロジェクト ファイルの "TargetFrameworks" プロパティに "{0}" への参照を追加してから、NuGet 復元を再実行してください。
ko: 프로젝트가 "{0}" 프레임워크를 참조하지 않습니다. 프로젝트 파일의 "TargetFrameworks" 속성에 "{0}"에 대한 참조를 추가한 후 NuGet 복원을 다시 실행하세요.
pl: Projekt nie odwołuje się do struktury „{0}”. Dodaj odwołanie do elementu „{0}” we właściwości „TargetFrameworks” w pliku projektu, a następnie ponownie uruchom przywracanie pakietu NuGet.
pt_br: Seu projeto não referencia a estrutura "{0}". Adicione uma referência a "{0}" na propriedade "TargetFrameworks" do arquivo de projeto e, em seguida, execute novamente a restauração do NuGet.
ru: Проект не ссылается на платформу "{0}". Добавьте ссылку на "{0}" в свойстве "TargetFrameworks" файла проекта, а затем повторно запустите восстановление NuGet.
tr: Projeniz "{0}" çerçevesine başvuruda bulunmuyor. Proje dosyanızın "TargetFrameworks" özelliğine "{0}" başvurusu ekleyin ve sonra NuGet geri yükleme işlemini yeniden çalıştırın.
zh_hans: 项目未引用“{0}”框架。请在项目文件的 "TargetFrameworks" 属性中添加对“{0}”的引用，然后重新运行 NuGet 还原。
zh_hant: 您的專案未參考 "{0}" 架構。請在專案檔的 "TargetFrameworks" 屬性中新增 "{0}" 的參考，然後重新執行 NuGet 還原。

# MissingFrameworkInProjectJson
source: Your project does not reference "{0}" framework. Add a reference to "{0}" in the "frameworks" section of your project.json and then re-run NuGet restore.
cs: Váš projekt neobsahuje referenci na architekturu {0}. Přidejte referenci na {0} do oddílu frameworks v souboru project.json a pak znovu spusťte obnovení balíčku NuGet.
de: Ihr Projekt verweist nicht auf das Framework "{0}". Fügen Sie im Abschnitt "frameworks" der Datei "project.json" einen Verweis auf "{0}" hinzu, und führen Sie dann die NuGet-Wiederherstellung erneut aus.
es: El proyecto no hace referencia al marco "{0}". Agregue una referencia a "{0}" en la sección "frameworks" del archivo project.json y vuelva a ejecutar la restauración de paquetes NuGet.
fr: Votre projet ne référence pas le framework "{0}". Ajoutez une référence à "{0}" dans la section "frameworks" de votre fichier project.json, puis réexécutez la restauration NuGet.
it: Il progetto non fa riferimento al framework "{0}". Aggiungere un riferimento a "{0}" nella sezione "frameworks" del file project.json e quindi eseguire di nuovo il ripristino di NuGet.
ja: プロジェクトが "{0}" フレームワークを参照していません。project.json の "frameworks" セクションに "{0}" への参照を追加してから、NuGet 復元を再実行してください。
ko: 프로젝트가 "{0}" 프레임워크를 참조하지 않습니다. project.json의 "frameworks" 섹션에 "{0}"에 대한 참조를 추가한 후 NuGet 복원을 다시 실행하세요.
pl: Projekt nie odwołuje się do struktury „{0}”. Dodaj odwołanie do elementu „{0}” w sekcji „frameworks” w pliku project.json, a następnie ponownie uruchom przywracanie pakietu NuGet.
pt_br: Seu projeto não referencia a estrutura "{0}". Adicione uma referência a "{0}" na seção "estruturas" do seu project.json e, em seguida, execute novamente a restauração do NuGet.
ru: Проект не ссылается на платформу "{0}". Добавьте ссылку на "{0}" в разделе "Платформы" файла project.json, а затем повторно запустите восстановление NuGet.
tr: Projeniz "{0}" çerçevesine başvuruda bulunmuyor. project.json dosyanızın "frameworks" bölümüne "{0}" başvurusu ekleyin ve sonra NuGet geri yükleme işlemini yeniden çalıştırın.
zh_hans: 项目未引用“{0}”框架。请在 project.json 的“框架”部分中添加对“{0}”的引用，然后重新运行 NuGet 还原。
zh_hant: 您的專案未參考 "{0}" 架構。請在 project.json 的 [架構] 區段中新增 "{0}" 的參考，然後重新執行 NuGet 還原。

# MissingPackageInTargetsForProjectJson
source: The package '{0}' could not be found in the libraries section of the lock file. This may indicate your lock file is corrupted.
cs: V oddílu libraries v souboru zámku nebyl nalezen balíček {0}. To může znamenat, že je soubor zámku poškozený.
de: Das Paket "{0}" wurde im Abschnitt "libraries" der Sperrdatei nicht gefunden. Dies weist möglicherweise darauf hin, dass Ihre Sperrdatei beschädigt ist.
es: No se encuentra el paquete "{0}" en la sección libraries del archivo de bloqueo. Esto puede indicar que el archivo de bloqueo está dañado.
fr: Le package '{0}' est introuvable dans la section des bibliothèques du fichier de verrouillage. Votre fichier de verrouillage est peut-être endommagé.
it: Non è stato possibile trovare il pacchetto '{0}' nella sezione libraries del file di blocco. Questo errore può indicare che il file di blocco è danneggiato.
ja: パッケージ '{0}' がロック ファイルの libraries セクションに見つかりませんでした。ロック ファイルが破損している可能性があります。
ko: 잠금 파일의 libraries 섹션에서 '{0}' 패키지를 찾을 수 없습니다. 잠금 파일이 손상되었다는 의미일 수 있습니다.
pl: Nie można odnaleźć pakietu „{0}” w sekcji bibliotek w pliku blokady. Może to wskazywać na uszkodzenie pliku blokady.
pt_br: Não foi possível localizar o pacote '{0}' na seção de bibliotecas do arquivo de bloqueio. Isso pode indicar que o arquivo de bloqueio está corrompido.
ru: Не удалось найти пакет "{0}" в разделе "Библиотеки" файла блокировки. Это может означать, что файл блокировки поврежден.
tr: '{0}' paketi, kilit dosyasının libraries bölümünde bulunamadı. Bu, kilit dosyanızın bozuk olduğunu gösteriyor olabilir.
zh_hans: 在锁定文件的“库”部分找不到包“{0}”。这可能说明锁定文件已损坏。
zh_hant: 在鎖定檔案的程式庫區段中找不到套件 '{0}'。這可能表示鎖定檔案已損毀。

# MissingPackageInTargetsSectionForProjectFile
source: The package '{0}' could not be found in the libraries section of the assets file. This may indicate your assets file is corrupted.
cs: V oddílu libraries v souboru prostředků nebyl nalezen balíček {0}. To může znamenat, že je soubor prostředků poškozený.
de: Das Paket "{0}" wurde im Abschnitt "libraries" der Ressourcendatei nicht gefunden. Dies weist möglicherweise darauf hin, dass Ihre Ressourcendatei beschädigt ist.
es: No se encuentra el paquete "{0}" en la sección libraries del archivo de recursos. Esto puede indicar que el archivo de recursos está dañado.
fr: Le package '{0}' est introuvable dans la section des bibliothèques du fichier de composants. Votre fichier de composants est peut-être endommagé.
it: Non è stato possibile trovare il pacchetto '{0}' nella sezione libraries del file di asset. Questo errore può indicare che il file di asset è danneggiato.
ja: パッケージ '{0}' がアセット ファイルの libraries セクションに見つかりませんでした。アセット ファイルが破損している可能性があります。
ko: 자산 파일의 libraries 섹션에서 '{0}' 패키지를 찾을 수 없습니다. 자산 파일이 손상되었다는 의미일 수 있습니다.
pl: Nie można odnaleźć pakietu „{0}” w sekcji bibliotek w pliku zasobów. Może to wskazywać na uszkodzenie pliku zasobów.
pt_br: Não foi possível localizar o pacote '{0}' na seção de bibliotecas do arquivo de ativos. Isso pode indicar que o arquivo de ativos está corrompido.
ru: Не удалось найти пакет "{0}" в разделе "Библиотеки" файла ресурсов. Это может означать, что файл ресурсов поврежден.
tr: '{0}' paketi, varlıklar dosyasının libraries bölümünde bulunamadı. Bu, varlıklar dosyanızın bozuk olduğunu gösteriyor olabilir.
zh_hans: 在资产文件的“库”部分找不到包“{0}”。这可能说明锁定文件已损坏。
zh_hant: 在資產檔案的程式庫區段中找不到套件 '{0}'。這可能表示資產檔案已損毀。

# MissingRuntimeIdentifierInProjectFile
source: Your project file doesn't list '{0}' as a "RuntimeIdentifier". You should add '{1}' to the "RuntimeIdentifiers" property in your project file (RuntimeIdentifiers should always be the complete list of RIDs supported by the project, regardless of the current configuration, platform or target. Single unconditioned RuntimeIdentifiers property is recommended) and then re-run NuGet restore.
cs: Váš soubor projektu neuvádí {0} jako identifikátor RuntimeIdentifier. Měli byste přidat {1} do vlastnosti RuntimeIdentifiers v souboru projektu a pak byste měli znovu spustit obnovení balíčku NuGet.
de: In der Projektdatei wird "{0}" nicht als "RuntimeIdentifier" aufgelistet. Sie müssen der Eigenschaft "RuntimeIdentifiers" in der Projektdatei "{1}" hinzufügen und dann die NuGet-Wiederherstellung erneut ausführen.
fr: Votre fichier projet ne liste pas '{0}' comme un "RuntimeIdentifier". Vous devez ajouter '{1}' à la propriété "RuntimeIdentifiers" dans votre fichier projet, puis réexécuter la restauration NuGet.
ja: プロジェクト ファイルで '{0}' が 'RuntimeIdentifier' としてリストされていません。プロジェクト ファイルの "RuntimeIdentifiers" プロパティに '{1}' を追加してから、NuGet 復元を再実行してください。
pl: Plik projektu nie zawiera elementu „{0}” jako właściwości „RuntimeIdentifier”. Dodaj element „{1}” do właściwości „RuntimeIdentifiers” w pliku projektu, a następnie ponownie uruchom przywracanie pakietu NuGet.
pt_br: O arquivo de projeto não lista '{0}' como um "RuntimeIdentifier". Você deve adicionar '{1}' à propriedade "RuntimeIdentifiers" no arquivo de projeto e, em seguida, executar novamente a restauração do NuGet.

# MissingRuntimeIdentifierPropertyInProjectFile
source: Your project file doesn't have the "RuntimeIdentifiers" property. You should add '{0}' to your project file and then re-run NuGet restore.
cs: Váš soubor projektu neobsahuje vlastnost RuntimeIdentifiers. Do souboru projektu byste měli přidat {0} a pak byste měli znovu spustit obnovení balíčku NuGet.
de: In der Projektdatei ist die Eigenschaft "RuntimeIdentifiers" nicht enthalten. Sie müssen Ihrer Projektdatei "{0}" hinzufügen und dann die NuGet-Wiederherstellung erneut ausführen.
es: El archivo del proyecto no tiene la propiedad "RuntimeIdentifiers". Debe agregar "{0}" al archivo del proyecto y volver a ejecutar la restauración de paquetes NuGet.
fr: Votre fichier projet n'a pas la propriété "RuntimeIdentifiers". Vous devez ajouter '{0}' à votre fichier projet, puis réexécuter la restauration NuGet.
it: Il file di progetto non contiene la proprietà "RuntimeIdentifiers". È necessario aggiungere '{0}' al file di progetto e quindi eseguire di nuovo il ripristino di NuGet.
ja: プロジェクト ファイルに "RuntimeIdentifiers" プロパティがありません。プロジェクト ファイルに '{0}' を追加してから、NuGet 復元を再実行してください。
ko: 프로젝트 파일에 "RuntimeIdentifiers" 속성이 없습니다. 프로젝트 파일에 '{0}'을(를) 추가한 후 NuGet 복원을 다시 실행해야 합니다.
pl: Plik projektu nie zawiera właściwości „RuntimeIdentifiers”. Dodaj element „{0}” do pliku projektu, a następnie ponownie uruchom przywracanie pakietu NuGet.
pt_br: O arquivo de projeto não tem a propriedade "RuntimeIdentifiers". Você deve adicionar '{0}' ao arquivo de projeto e, em seguida, executar novamente a restauração do NuGet.
ru: В файле проекта отсутствует свойство "RuntimeIdentifiers". Необходимо добавить "{0}" в файл проекта, а затем повторно запустить восстановление NuGet.
tr: Proje dosyanız "RuntimeIdentifiers" özelliğine sahip değil. Proje dosyanıza '{0}' tanımlayıcısını eklemeniz ve sonra NuGet geri yükleme işlemini yeniden çalıştırmanız gerekiyor.
zh_hans: 项目文件没有 "RuntimeIdentifiers" 属性。应将“{0}”添加到项目文件，然后重新运行 NuGet 还原。
zh_hant: 您的專案檔沒有 "RuntimeIdentifiers" 屬性。您應該將 '{0}' 新增到專案檔，然後重新執行 NuGet 還原。

# MissingRuntimeInProjectJson
source: Your project.json doesn't list '{0}' as a "RuntimeIdentifier". You should add '{1}' inside your "runtimes" section in your project.json and then re-run NuGet restore.
cs: Váš soubor projektu neuvádí {0} jako identifikátor RuntimeIdentifier. Měli byste přidat {1} do oddílu runtimes v souboru project.json a pak byste měli znovu spustit obnovení balíčku NuGet.
de: In der Datei "project.json" wird "{0}" nicht als "RuntimeIdentifier" aufgelistet. Sie müssen "{1}" dem Abschnitt "runtimes" in der Datei "project.json" hinzufügen und dann die NuGet-Wiederherstellung erneut ausführen.
es: El archivo project.json no muestra "{0}" como "RuntimeIdentifier". Debe agregar "{1}" en la sección "runtimes" del archivo project.json y volver a ejecutar la restauración de paquetes NuGet.
fr: Votre fichier project.json ne liste pas '{0}' comme un "RuntimeIdentifier". Vous devez ajouter '{1}' dans la section "runtimes" de votre fichier project.json, puis réexécuter la restauration NuGet.
it: Il file project.json non elenca '{0}' come "RuntimeIdentifier". È necessario aggiungere '{1}' all'interno della sezione "runtimes" del file project.json e quindi eseguire di nuovo il ripristino di NuGet.
ja: project.json で '{0}' が 'RuntimeIdentifier' としてリストされていません。project.json の "runtimes" セクション内に '{1}' を追加してから、NuGet 復元を再実行してください。
ko: project.json에 '{0}'이(가) "RuntimeIdentifier"로 나열되지 않습니다. project.json의 "runtimes" 섹션 내에 '{1}'을(를) 추가한 후 NuGet 복원을 다시 실행해야 합니다.
pl: Plik project.json nie zawiera elementu „{0}” jako właściwości „RuntimeIdentifier”. Dodaj element „{1}” w sekcji „runtimes” w pliku project.json, a następnie ponownie uruchom przywracanie pakietu NuGet.
pt_br: Seu project.json não lista '{0}' como um "RuntimeIdentifier". Você deve adicionar '{1}' na seção "runtimes" no seu project.json e, em seguida, executar novamente a restauração do NuGet.
ru: Файл project.json не перечисляет "{0}" как "RuntimeIdentifier". Необходимо добавить "{1}" в раздел "Среды выполнения" в файл project.json, а затем повторно запустить восстановление NuGet.
tr: '{0}' tanımlayıcısı, project.json dosyanızda "RuntimeIdentifier" olarak listelenmiyor. project.json dosyanızın "runtimes" bölümüne '{1}' tanımlayıcısını eklemeniz ve sonra NuGet geri yükleme işlemini yeniden çalıştırmanız gerekiyor.
zh_hans: project.json 未将“{0}”列为 "RuntimeIdentifier"。应在 project.json 的“运行时”部分添加“{1}”，然后重新运行 NuGet 还原。
zh_hant: 您的 project.json 未將 '{0}' 列為 "RuntimeIdentifier"。您應該在 project.json 的 [執行階段] 區段中新增 '{1}'，然後重新執行 NuGet 還原。

# MissingRuntimesSectionInProjectJson
source: Your project.json doesn't have a runtimes section. You should add '{0}' to your project.json and then re-run NuGet restore.
cs: Váš soubor project.json neobsahuje oddíl runtimes. Do souboru project.json byste měli přidat {0} a pak byste měli znovu spustit obnovení balíčku NuGet.
de: In der Datei "project.json" ist kein Abschnitt "runtimes" enthalten. Sie müssen "{0}" Ihrer Datei "project.json" hinzufügen und dann die NuGet-Wiederherstellung erneut ausführen.
es: El archivo project.json no tiene una sección runtimes. Debe agregar "{0}" al archivo project.json y volver a ejecutar la restauración de paquetes NuGet.
fr: Votre fichier project.json n'a pas de section de runtimes. Vous devez ajouter '{0}' à votre fichier project.json, puis réexécuter la restauration NuGet.
it: Il file project.json non contiene una sezione runtimes. È necessario aggiungere '{0}' al file project.json e quindi eseguire di nuovo il ripristino di NuGet.
ja: project.json に runtimes セクションがありません。'{0}' を project.json に追加してから、NuGet 復元を再実行してください。
ko: project.json에 runtimes 섹션이 없습니다. project.json에 '{0}'을(를) 추가한 후 NuGet 복원을 다시 실행해야 합니다.
pl: Plik project.json nie zawiera sekcji „runtimes”. Dodaj element „{0}” do pliku project.json, a następnie ponownie uruchom przywracanie pakietu NuGet.
pt_br: Seu project.json não tem uma seção de runtimes. Você deve adicionar '{0}' ao project.json e, em seguida, executar novamente a restauração do NuGet.
ru: В файле project.json отсутствует раздел "Среды выполнения". Необходимо добавить "{0}" в файл project.json, а затем повторно запустить восстановление NuGet.
tr: project.json dosyanızda runtimes bölümü yok. project.json dosyanıza '{0}' tanımlayıcısını eklemeniz ve sonra NuGet geri yükleme işlemini yeniden çalıştırmanız gerekiyor.
zh_hans: project.json 没有“运行时”部分。应将“{0}”添加到 project.json，然后重新运行 NuGet 还原。
zh_hant: 您的 project.json 沒有執行階段區段。您應該將 '{0}' 新增到 project.json，然後重新執行 NuGet 還原。

# NoTargetsInLockFileForProjectFile
source: No targets could be found in the assets file. Make sure you have "RuntimeIdentifiers" property in your project file.
cs: V souboru prostředků nebyly nalezeny žádné cíle. Ujistěte se, že váš soubor projektu obsahuje vlastnost RuntimeIdentifiers.
de: In der Ressourcendatei wurden keine Ziele gefunden. Stellen Sie sicher, dass die Eigenschaft "RuntimeIdentifiers" in der Projektdatei vorhanden ist.
es: No se encontró ningún destino en el archivo de recursos. Asegúrese de que está la propiedad "RuntimeIdentifiers" en el archivo del proyecto.
fr: Aucune cible dans le fichier de composants. Vérifiez que vous avez la propriété "RuntimeIdentifiers" dans votre fichier projet.
it: Non è stata trovata alcuna destinazione nel file di asset. Assicurarsi che nel file di progetto sia presente una proprietà "RuntimeIdentifiers".
ja: アセット ファイルにターゲットが見つかりませんでした。プロジェクト ファイルに "RuntimeIdentifiers" プロパティがあることをご確認ください。
ko: 자산 파일에서 대상을 찾을 수 없습니다. 프로젝트 파일에 "RuntimeIdentifiers" 속성이 있는지 확인하세요.
pl: Nie można znaleźć żadnych elementów docelowych w pliku zasobów. Upewnij się, że a plik projektu zawiera właściwość „RuntimeIdentifiers”.
pt_br: Nenhum destino foi localizado no arquivo de ativos. Verifique se você tem a propriedade "RuntimeIdentifiers" no seu arquivo de projeto.
ru: Не удалось найти целевые объекты в файле ресурсов. Убедитесь, что в файле проекта имеется свойство "RuntimeIdentifiers".
tr: Varlıklar dosyasında hedef bulunamadı. Proje dosyanızda "RuntimeIdentifiers" özelliğinin bulunduğundan emin olun.
zh_hans: 在资产文件中找不到任何目标。请确保项目文件中具有 "RuntimeIdentifiers" 属性。
zh_hant: 在資產檔案中找不到任何目標。請確定您的專案檔中有 "RuntimeIdentifiers" 屬性。

# NoTargetsInLockFileForProjectJson
source: No targets could be found in the lock file. Make sure you have a supports or runtimes section in your project.json file.
cs: V souboru zámku nebyly nalezeny žádné cíle. Ujistěte se, že váš soubor project.json obsahuje oddíl supports nebo oddíl runtimes.
de: In der Sperrdatei wurden keine Ziele gefunden. Stellen Sie sicher, dass Ihre Datei "project.json" einen Abschnitt "supports" oder "runtimes" aufweist.
es: No se encontró ningún destino en el archivo de bloqueo. Asegúrese de que hay una sección supports o runtimes en el archivo project.json.
fr: Aucune cible dans le fichier de verrouillage. Vérifiez que vous avez une section "supports" ou "runtimes" dans votre fichier project.json.
it: Non è stato possibile trovare destinazioni nel file di blocco. Assicurarsi che nel file project.json sia presente una sezione supports o runtimes.
ja: ロック ファイルにターゲットが見つかりませんでした。project.json ファイルに supports セクションまたは runtimes セクションがあることをご確認ください。
ko: 잠금 파일에서 대상을 찾을 수 없습니다. project.json 파일에 supports 또는 runtimes 섹션이 있는지 확인하세요.
pl: Nie można odnaleźć elementów docelowych w pliku blokady. Upewnij się, że plik project.json zawiera sekcję „supports” lub „runtimes”.
pt_br: Nenhum destino foi localizado no arquivo de bloqueio. Verifique se você tem uma seção de suporte ou de runtime no seu arquivo project.json.
ru: Не удалось найти целевые объекты в файле блокировки. Убедитесь, что в файле project.json имеется раздел "Поддержка" или "Среды выполнения".
tr: Kilit dosyasında hedef bulunamadı. project.json dosyanızda supports veya runtimes bölümü bulunduğundan emin olun.
zh_hans: 在锁定文件中找不到任何目标。请确保 project.json 文件中具有“支持”或“运行时”部分。
zh_hant: 鎖定檔案中找不到任何目標。請確定您的 project.json 檔案中有支援或執行階段區段。
